# Pandas

- The pandas library is a central component of the data science toolkit. 
- It is used in conjunction with other libraries in that collection.

- It is built on top of the NumPy package, meaning a lot of the structure of NumPy is used or replicated in Pandas. 

- Data in pandas is often used to feed statistical analysis in SciPy, plotting functions from Matplotlib, and machine learning algorithms in Scikit-learn.

Pandas is very similar to Excel. You will be comfortable working with structured data in Pandas when using Python

In [2]:
#!pip install pandas
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

Tip: The three imports above are very useful when performing data analysis in python. Stick to their alias, since it is the defacto in the industry.

In [5]:
df = pd.read_csv('housing.csv', sep=',',)
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

Pandas have 2 major data containers/data types, `Series` and `DataFrame`

In [7]:
df['longitude'].head()

0   -122.23
1   -122.22
2   -122.24
3   -122.25
4   -122.25
Name: longitude, dtype: float64

In [9]:
type(df), type(df['longitude'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

A series is similar in stuctured to a 1-array but with other information like index, header etc.

In [10]:
df['longitude']

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

We'll use `.values` to convert any pandas object to numpy.

In [13]:
df['longitude'].values # or use df['longitude'].to_numpy()

array([-122.23, -122.22, -122.24, ..., -121.22, -121.32, -121.24])

In [14]:
df['longitude'].to_numpy()

array([-122.23, -122.22, -122.24, ..., -121.22, -121.32, -121.24])

 To convert directly to a list we'll use the casting function `list`

In [15]:
list(df['longitude'])[:10]

[-122.23,
 -122.22,
 -122.24,
 -122.25,
 -122.25,
 -122.25,
 -122.25,
 -122.25,
 -122.26,
 -122.25]

Creating a Series by passing a list of values, letting pandas create a default integer index or include an index. We can create a pandas series from a python list, numpy array or dictionary

In [16]:
ex1_labels = ['a','b','c']
ex1_list = [10, 20, 30]
ex1_arr = np.array([10,20,30])
ex1_dict = {'a' : 10,'b' : 20,'c' : 30}

In [17]:
pd.Series(data=ex1_labels)

0    a
1    b
2    c
dtype: object

In [18]:
pd.Series(data=ex1_list, index=ex1_labels)

a    10
b    20
c    30
dtype: int64

**Let's create a series once using `numpy.array` and another using `dict`.**

In [19]:
# using numpy.array
arr = np.array(['a', 'b', 'c', 'd', 'e'])
pd.Series(arr)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [20]:
# using dict
d = {0:'a', 1:'b', 2:'c', 3:'d', 4:'e'}
pd.Series(d)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [22]:
#NOTE: dict can be used as index; the keys will only be considered as indices
d = {9:'a', 1:'b', 2:'c', 3:'d', 4:'e'}
arr = np.array(['v', 'w', 'x', 'y', 'z'])
pd.Series(arr, index=d)

9    v
1    w
2    x
3    y
4    z
dtype: object

NB: The datatype shown indicates the type of python object currently stored in the Series container

### Operations on Series

In [23]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany','USSR', 'Japan']) 
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany','Italy', 'Japan'])

In [24]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [25]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [26]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [27]:
ser1 * ser2

Germany     4.0
Italy       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

## Dataframe

This is the workhorse of Pandas.

In [28]:
from numpy.random import randn
np.random.seed(101)

In [32]:
df2 = pd.DataFrame(randn(5,4),
                   index=list('ABCDE'),
                   columns='U V W X'.split()
                   )

In [35]:
df2.head()

          U         V         W         X
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

Pandas can store almost any python object in its dataframe.

In [36]:
df2.dtypes

U    float64
V    float64
W    float64
X    float64
dtype: object

In [39]:
df3 = pd.DataFrame(
            {
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo"
            }
          )

In [42]:
df3.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [43]:
df3.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Different datatypes can be stored in the same dataframe, not necessarily objects of the same datatype. When the objects in a column are strings or of mixed types, the column is given a type, `object`


Let's create a pandas dataframe with the following datatypes as columns:
- float32
- int
- object

In [44]:
pd.DataFrame(
    {"id": range(5),
     "names": list("ABCDE"),
     "scores": [10., 10., 4., 6., 7.]}
)

   id names  scores
0   0     A    10.0
1   1     B    10.0
2   2     C     4.0
3   3     D     6.0
4   4     E     7.0

### Selection and Indexing

In [45]:
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [46]:
obj1 = df3['A']
obj1

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [47]:
type(obj1)

pandas.core.series.Series

In [48]:
obj2 = df3[['A']]
obj2

     A
0  1.0
1  1.0
2  1.0
3  1.0

In [49]:
type(obj2)

pandas.core.frame.DataFrame

Tip: To return a dataframe from a selection, use double brackets

In [50]:
df3[['B', 'C']]

           B    C
0 2013-01-02  1.0
1 2013-01-02  1.0
2 2013-01-02  1.0
3 2013-01-02  1.0

In [34]:
#df3['B', 'C']  #this will throw an error

In [52]:
df.longitude # not commonly used because it can fail in some instance

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

Row Indexing

In [53]:
df4 = df[0:100].copy()

In [54]:
df4.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [55]:
df4['pop/household'] = df4['population'] / df4['households']

In [56]:
df4

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,pop/household
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY,2.555556
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY,2.109842
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY,2.802260
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY,2.547945
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY,2.181467
...,...,...,...,...,...,...,...,...,...,...,...
95,-122.26,37.80,36.0,5329.0,2477.0,3469.0,2323.0,2.0096,130000.0,NEAR BAY,1.493328
96,-122.26,37.82,31.0,4596.0,1331.0,2048.0,1180.0,2.8345,183800.0,NEAR BAY,1.735593
97,-122.26,37.81,29.0,335.0,107.0,202.0,91.0,2.0062,125000.0,NEAR BAY,2.219780
98,-122.26,37.82,22.0,3682.0,1270.0,2024.0,1250.0,1.2185,170000.0,NEAR BAY,1.619200
99,-122.26,37.82,37.0,3633.0,1085.0,1838.0,980.0,2.6104,193100.0,NEAR BAY,1.875510

### Removing columns

In [57]:
df4.drop('population', axis=1)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,households,median_income,median_house_value,ocean_proximity,pop/household
0,-122.23,37.88,41.0,880.0,129.0,126.0,8.3252,452600.0,NEAR BAY,2.555556
1,-122.22,37.86,21.0,7099.0,1106.0,1138.0,8.3014,358500.0,NEAR BAY,2.109842
2,-122.24,37.85,52.0,1467.0,190.0,177.0,7.2574,352100.0,NEAR BAY,2.802260
3,-122.25,37.85,52.0,1274.0,235.0,219.0,5.6431,341300.0,NEAR BAY,2.547945
4,-122.25,37.85,52.0,1627.0,280.0,259.0,3.8462,342200.0,NEAR BAY,2.181467
...,...,...,...,...,...,...,...,...,...,...
95,-122.26,37.80,36.0,5329.0,2477.0,2323.0,2.0096,130000.0,NEAR BAY,1.493328
96,-122.26,37.82,31.0,4596.0,1331.0,1180.0,2.8345,183800.0,NEAR BAY,1.735593
97,-122.26,37.81,29.0,335.0,107.0,91.0,2.0062,125000.0,NEAR BAY,2.219780
98,-122.26,37.82,22.0,3682.0,1270.0,1250.0,1.2185,170000.0,NEAR BAY,1.619200
99,-122.26,37.82,37.0,3633.0,1085.0,980.0,2.6104,193100.0,NEAR BAY,1.875510

In [59]:
df4.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity', 'pop/household'],
      dtype='object')

Tip: Always set `inplace=True` to perform an operation on a dataframe or make a copy of the operation by assigning to another dataframe

In [60]:
df4.drop('population', axis=1, inplace=True)
# or
# df4 = df4.drop('population', axis=1)
# del df4['population']

In [61]:
df4

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,households,median_income,median_house_value,ocean_proximity,pop/household
0,-122.23,37.88,41.0,880.0,129.0,126.0,8.3252,452600.0,NEAR BAY,2.555556
1,-122.22,37.86,21.0,7099.0,1106.0,1138.0,8.3014,358500.0,NEAR BAY,2.109842
2,-122.24,37.85,52.0,1467.0,190.0,177.0,7.2574,352100.0,NEAR BAY,2.802260
3,-122.25,37.85,52.0,1274.0,235.0,219.0,5.6431,341300.0,NEAR BAY,2.547945
4,-122.25,37.85,52.0,1627.0,280.0,259.0,3.8462,342200.0,NEAR BAY,2.181467
...,...,...,...,...,...,...,...,...,...,...
95,-122.26,37.80,36.0,5329.0,2477.0,2323.0,2.0096,130000.0,NEAR BAY,1.493328
96,-122.26,37.82,31.0,4596.0,1331.0,1180.0,2.8345,183800.0,NEAR BAY,1.735593
97,-122.26,37.81,29.0,335.0,107.0,91.0,2.0062,125000.0,NEAR BAY,2.219780
98,-122.26,37.82,22.0,3682.0,1270.0,1250.0,1.2185,170000.0,NEAR BAY,1.619200
99,-122.26,37.82,37.0,3633.0,1085.0,980.0,2.6104,193100.0,NEAR BAY,1.875510

Drop rows

In [62]:
df = df.drop([1, 2], axis=0)

In [63]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY

- Using `df4`, compute the total number of bedrooms per household
- Which location has the highest number of bedrooms per household

In [64]:
df4["bedrooms/household"] = df4["total_bedrooms"] / df4["households"]
df4

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,households,median_income,median_house_value,ocean_proximity,pop/household,bedrooms/household
0,-122.23,37.88,41.0,880.0,129.0,126.0,8.3252,452600.0,NEAR BAY,2.555556,1.023810
1,-122.22,37.86,21.0,7099.0,1106.0,1138.0,8.3014,358500.0,NEAR BAY,2.109842,0.971880
2,-122.24,37.85,52.0,1467.0,190.0,177.0,7.2574,352100.0,NEAR BAY,2.802260,1.073446
3,-122.25,37.85,52.0,1274.0,235.0,219.0,5.6431,341300.0,NEAR BAY,2.547945,1.073059
4,-122.25,37.85,52.0,1627.0,280.0,259.0,3.8462,342200.0,NEAR BAY,2.181467,1.081081
...,...,...,...,...,...,...,...,...,...,...,...
95,-122.26,37.80,36.0,5329.0,2477.0,2323.0,2.0096,130000.0,NEAR BAY,1.493328,1.066294
96,-122.26,37.82,31.0,4596.0,1331.0,1180.0,2.8345,183800.0,NEAR BAY,1.735593,1.127966
97,-122.26,37.81,29.0,335.0,107.0,91.0,2.0062,125000.0,NEAR BAY,2.219780,1.175824
98,-122.26,37.82,22.0,3682.0,1270.0,1250.0,1.2185,170000.0,NEAR BAY,1.619200,1.016000
99,-122.26,37.82,37.0,3633.0,1085.0,980.0,2.6104,193100.0,NEAR BAY,1.875510,1.107143

In [65]:
idx = df4["bedrooms/household"].argmax()
df4.iloc[[idx]]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,households,median_income,median_house_value,ocean_proximity,pop/household,bedrooms/household
67,-122.29,37.8,52.0,1027.0,244.0,147.0,2.6094,81300.0,NEAR BAY,3.346939,1.659864

### Viewing data

In [66]:
df.index

Int64Index([    0,     3,     4,     5,     6,     7,     8,     9,    10,
               11,
            ...
            20630, 20631, 20632, 20633, 20634, 20635, 20636, 20637, 20638,
            20639],
           dtype='int64', length=20638)

In [67]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')

In [72]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY

In [69]:
df.tail()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

Tip: Use `.columns` and `.index` to get the column names or index names respectively. Use `.head()` and `.tail` to get the beginning or end of the dataframe or series.

Select rows

In [70]:
df.iloc

In [76]:
df.iloc[2]

longitude              -122.25
latitude                 37.85
housing_median_age        52.0
total_rooms             1627.0
total_bedrooms           280.0
population               565.0
households               259.0
median_income           3.8462
median_house_value    342200.0
ocean_proximity       NEAR BAY
Name: 4, dtype: object

In [78]:
df.iloc[[3, 4]] #searcheds for the index order
# it returns the fifth index because it's the third one

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY

In [80]:
df.iloc[[3,4], [1,0]]

   latitude  longitude
5     37.85    -122.25
6     37.84    -122.25

In [83]:
df.iloc[range(len(df)), [1,2,3]]  #select a bunch of columns

       latitude  housing_median_age  total_rooms
0         37.88                41.0        880.0
3         37.85                52.0       1274.0
4         37.85                52.0       1627.0
5         37.85                52.0        919.0
6         37.84                52.0       2535.0
...         ...                 ...          ...
20635     39.48                25.0       1665.0
20636     39.49                18.0        697.0
20637     39.43                17.0       2254.0
20638     39.43                18.0       1860.0
20639     39.37                16.0       2785.0

[20638 rows x 3 columns]

In [86]:
df.loc[[10, 11]] #searches for the exact indices

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
10,-122.26,37.85,52.0,2202.0,434.0,910.0,402.0,3.2031,281500.0,NEAR BAY
11,-122.26,37.85,52.0,3503.0,752.0,1504.0,734.0,3.2705,241800.0,NEAR BAY

In [87]:
df.loc[3]

longitude              -122.25
latitude                 37.85
housing_median_age        52.0
total_rooms             1274.0
total_bedrooms           235.0
population               558.0
households               219.0
median_income           5.6431
median_house_value    341300.0
ocean_proximity       NEAR BAY
Name: 3, dtype: object

Tip: `.loc` is used for indexing when the list of indexes are not non-numbers

In [88]:
df3.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

Tip: Convert dataframe to numpy using `.to_numpy()`. Does not include column names or indices

In [90]:
df3.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [92]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 288.0+ bytes

In [93]:
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [94]:
df3.iloc[0,2] = np.nan
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  NaN  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [97]:
df3.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,NaN,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

### Sort Values

In [98]:
df2.sort_values(by='W', ascending=False)

          U         V         W         X
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752
A  0.302665  1.693723 -1.706086 -1.159119

### Conditional Selection

In [99]:
df2

          U         V         W         X
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [100]:
df2 > 0

       U      V      W      X
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [101]:
df2[df2 > 0]

          U         V         W         X
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [102]:
df2['W'] > 0

A    False
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [103]:
df2[df2['W'] > 0]

          U         V         W         X
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

For two conditions you can use | and & with parenthesis:

In [105]:
df2[ (df2['U']>0) & (df2['X'] > 0.1)]

          U        V         W         X
C  0.807706  0.07296  0.638787  0.329646

Select from `df4` where the `population/household` is greater than `2.5`, and the `income` is not more than `50`.

In [106]:
df4[(df4["pop/household"]>2.5) & (df4["median_income"]<=50)]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,households,median_income,median_house_value,ocean_proximity,pop/household,bedrooms/household
0,-122.23,37.88,41.0,880.0,129.0,126.0,8.3252,452600.0,NEAR BAY,2.555556,1.023810
2,-122.24,37.85,52.0,1467.0,190.0,177.0,7.2574,352100.0,NEAR BAY,2.802260,1.073446
3,-122.25,37.85,52.0,1274.0,235.0,219.0,5.6431,341300.0,NEAR BAY,2.547945,1.073059
15,-122.26,37.85,50.0,1120.0,283.0,264.0,2.1250,140000.0,NEAR BAY,2.640152,1.071970
19,-122.27,37.84,52.0,1503.0,298.0,275.0,2.6033,162900.0,NEAR BAY,2.509091,1.083636
21,-122.27,37.85,42.0,1639.0,367.0,366.0,1.7135,159800.0,NEAR BAY,2.538251,1.002732
23,-122.27,37.84,52.0,1688.0,337.0,325.0,2.1806,99700.0,NEAR BAY,2.624615,1.036923
25,-122.28,37.85,41.0,535.0,123.0,119.0,2.4038,107500.0,NEAR BAY,2.663866,1.033613
26,-122.28,37.85,49.0,1130.0,244.0,239.0,2.4597,93800.0,NEAR BAY,2.539749,1.020921
27,-122.28,37.85,52.0,1898.0,421.0,397.0,1.8080,105500.0,NEAR BAY,2.775819,1.060453
29,-122.28,37.84,52.0,729.0,160.0,155.0,1.6875,132000.0,NEAR BAY,2.548387,1.032258
31,-122.28,37.84,52.0,2153.0,481.0,441.0,1.9615,115200.0,NEAR BAY,2.648526,1.090703
32,-122.27,37.84,48.0,1922.0,409.0,335.0,1.7969,110400.0,NEAR BAY,3.062687,1.220896
36,-122.27,37.83,48.0,1798.0,432.0,374.0,1.0972,104500.0,NEAR BAY,2.639037,1.155080
48,-122.26,37.82,40.0,624.0,195.0,160.0,0.9506,187500.0,NEAR BAY,2.643750,1.218750
51,-122.27,37.82,43.0,1868.0,456.0,407.0,1.5045,93800.0,NEAR BAY,2.606880,1.120393
52,-122.27,37.82,41.0,3221.0,853.0,720.0,1.1108,97500.0,NEAR BAY,2.720833,1.184722
53,-122.27,37.82,52.0,1630.0,456.0,400.0,1.2475,104200.0,NEAR BAY,2.905000,1.140000
54,-122.28,37.82,52.0,1170.0,235.0,233.0,1.6098,87500.0,NEAR BAY,3.008584,1.008584
55,-122.28,37.82,52.0,945.0,243.0,220.0,1.4113,83100.0,NEAR BAY,2.618182,1.104545
57,-122.28,37.82,52.0,1489.0,335.0,244.0,0.8172,85300.0,NEAR BAY,2.983607,1.372951
58,-122.28,37.82,52.0,1387.0,341.0,304.0,1.2171,80300.0,NEAR BAY,3.532895,1.121711
60,-122.29,37.83,52.0,1121.0,211.0,187.0,3.3929,75700.0,NEAR BAY,2.962567,1.128342
61,-122.29,37.82,49.0,135.0,29.0,23.0,6.1183,75000.0,NEAR BAY,3.739130,1.260870
62,-122.29,37.81,50.0,760.0,190.0,122.0,0.9011,86100.0,NEAR BAY,3.090164,1.557377
63,-122.30,37.81,52.0,1224.0,237.0,159.0,1.1910,76100.0,NEAR BAY,3.276730,1.490566
64,-122.30,37.81,48.0,828.0,182.0,133.0,2.5938,73500.0,NEAR BAY,2.947368,1.368421
65,-122.30,37.81,52.0,1010.0,209.0,187.0,1.1667,78400.0,NEAR BAY,3.229947,1.117647
67,-122.29,37.80,52.0,1027.0,244.0,147.0,2.6094,81300.0,NEAR BAY,3.346939,1.659864
68,-122.30,37.81,52.0,572.0,109.0,82.0,1.8516,85000.0,NEAR BAY,3.341463,1.329268
69,-122.29,37.81,46.0,2801.0,644.0,611.0,0.9802,129200.0,NEAR BAY,2.983633,1.054010
70,-122.29,37.81,26.0,768.0,152.0,127.0,1.7719,82500.0,NEAR BAY,3.086614,1.196850
72,-122.29,37.81,49.0,844.0,204.0,152.0,1.7500,75000.0,NEAR BAY,3.684211,1.342105
73,-122.29,37.81,46.0,12.0,4.0,7.0,0.4999,67500.0,NEAR BAY,2.571429,0.571429
77,-122.28,37.81,19.0,1207.0,243.0,207.0,1.1111,108300.0,NEAR BAY,3.483092,1.173913
78,-122.29,37.81,23.0,1745.0,374.0,325.0,0.8026,112500.0,NEAR BAY,3.243077,1.150769
81,-122.27,37.81,52.0,210.0,56.0,56.0,1.1667,112500.0,NEAR BAY,3.267857,1.000000
84,-122.28,37.81,35.0,948.0,184.0,169.0,1.8088,118800.0,NEAR BAY,2.763314,1.088757
85,-122.28,37.81,52.0,773.0,143.0,115.0,2.4083,98200.0,NEAR BAY,3.278261,1.243478
88,-122.27,37.80,10.0,105.0,42.0,39.0,0.9722,137500.0,NEAR BAY,3.205128,1.076923
89,-122.27,37.80,52.0,249.0,78.0,85.0,1.2434,500001.0,NEAR BAY,4.658824,0.917647
91,-122.28,37.80,52.0,215.0,87.0,88.0,0.8668,137500.0,NEAR BAY,10.272727,0.988636
92,-122.28,37.80,52.0,96.0,31.0,34.0,0.7500,162500.0,NEAR BAY,5.617647,0.911765
94,-122.27,37.80,39.0,1715.0,623.0,467.0,1.8477,179200.0,NEAR BAY,2.841542,1.334047

In [107]:
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY

In [109]:
# Reset to default 0,1...n index
df.reset_index()

,index,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
2,4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
3,5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
4,6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...,...
20633,20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20634,20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20635,20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20636,20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20637,20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

Tip: Use `drop=True` to drop the old index from the dataframe

In [111]:
df.reset_index(drop=True)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
2,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
3,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
4,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20633,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20634,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20635,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20636,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20637,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

### Dealing with missing data

In [112]:
df5 = pd.DataFrame({'A':[1,2,np.nan],
                    'B':[5,np.nan,np.nan],
                    'C':[1,2,3]})

In [113]:
df5

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [115]:
df5.dropna()

     A    B  C
0  1.0  5.0  1

In [116]:
df5.dropna(axis=1)

   C
0  1
1  2
2  3

In [118]:
df5.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [119]:
df5.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [120]:
df5['A'].fillna(value=df5['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Groupby

In [122]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Ahmed','Kobby','Aissa','Modou','Nando','Armand'],
       'Result':[200, 120, 340,124,243,350]}

In [123]:
df6 = pd.DataFrame(data)

Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [124]:
df6.groupby('Company')

In [125]:
comp_mean = df6.groupby("Company").mean()

C:\Users\dell\AppData\Local\Temp\ipykernel_12040\154747386.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  comp_mean = df6.groupby("Company").mean()

In [126]:
comp_std = df6.groupby("Company").std()

C:\Users\dell\AppData\Local\Temp\ipykernel_12040\24812473.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  comp_std = df6.groupby("Company").std()

In [127]:
by_comp = df6.groupby("Company")

In [135]:
by_comp.min()[["Result"]]

         Result
Company
FB          243
GOOG        120
MSFT        124

In [136]:
by_comp.max()[["Result"]]

         Result
Company
FB          350
GOOG        200
MSFT        340

In [137]:
by_comp.count()[["Result"]]

         Result
Company
FB            2
GOOG          2
MSFT          2

In [138]:
by_comp.describe()

        Result
         count   mean         std    min     25%    50%     75%    max
Company
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [140]:
by_comp.describe().T

Company               FB        GOOG        MSFT
Result count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000

In [142]:
by_comp.describe().transpose()

pandas.core.frame.DataFrame

In [144]:
by_comp.describe().transpose()['GOOG']

Result  count      2.000000
        mean     160.000000
        std       56.568542
        min      120.000000
        25%      140.000000
        50%      160.000000
        75%      180.000000
        max      200.000000
Name: GOOG, dtype: float64

### Merging, Joining and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating

In [145]:
df_a = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df_a

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [147]:
df_b = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df_b

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [148]:
df_c = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df_c

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation

In [149]:
pd.concat([df_a, df_b, df_c])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [150]:
pd.concat([df_a, df_b, df_c], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Merging

In [151]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [152]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [153]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [155]:
pd.merge(left, right, on=['key1'])

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [157]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [158]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [159]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [161]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [163]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [164]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [165]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [166]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [168]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Other Pandas operations

In [169]:
df7 = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444, 555, 666, 444],
                   'col3':['abc','def','ghi','xyz']})

df7.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Information on unique values

In [174]:
# To get unique values in a dataframe
df7['col2'].unique()

array([444, 555, 666], dtype=int64)

In [175]:
df7['col2'].nunique()

3

In [179]:
df7['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Applying functions

In [180]:
def times2(x):
    return x*2

In [181]:
df7['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [184]:
df7['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [185]:
df7['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [186]:
df7

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [187]:
df7['col1'].sum()

10

Find Null Values or Check for Null Values

In [188]:
df7.isnull() # or df6.isna()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [189]:
# Drop rows with NaN Values
df7.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [190]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df8 = pd.DataFrame(data)

In [191]:
df8.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

Pandas can read table tabs off of html. For example:

In [199]:
df10 = pd.read_html('https://en.wikipedia.org/wiki/Local_government_areas_of_Nigeria')

Pandas can also read from SQL, just so you know :)

Other resources to learn about Pandas

- https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html
- https://pandas.pydata.org/pandas-docs/stable/user_guide/cookbook.html#cookbook